In [1]:
#Pandas

import pandas as pd

In [2]:
data = {'Name':['Alice', 'Bob', 'Charlie'], 'Age':[15, 17, 19], 'City':['Cuttack', 'Bhubaneswar', 'Berhampur']}
df = pd.DataFrame(data)
df #print()

      Name  Age         City
0    Alice   15      Cuttack
1      Bob   17  Bhubaneswar
2  Charlie   19    Berhampur

In [3]:
#1 Display a column:

df['Age'] #print()

0    15
1    17
2    19
Name: Age, dtype: int64

In [4]:
#2 Print a row

df.iloc[0] #print()

Name      Alice
Age          15
City    Cuttack
Name: 0, dtype: object

In [5]:
#3 Particular Data Elemement:

print(df.at[1, 'Age'])

17

In [6]:
#4 Add Column:

df['Mark'] = [10, 20, 30]
df #print()

      Name  Age         City  Mark
0    Alice   15      Cuttack    10
1      Bob   17  Bhubaneswar    20
2  Charlie   19    Berhampur    30

In [7]:
#5 Adding a row:
#will duplicae if you run multiple times.
#append and concat functions are also there

df.loc[len(df)] = ['John', 18, 'Rourkela', 40] #len(df) gives position of 'last row' / 'end index'
df #print()

      Name  Age         City  Mark
0    Alice   15      Cuttack    10
1      Bob   17  Bhubaneswar    20
2  Charlie   19    Berhampur    30
3     John   18     Rourkela    40

In [8]:
#6 Mean, Min, Max of a column:

print(df['Age'].mean())
print(df['Age'].min())
print(df['Age'].max())

17.25
15
19

In [9]:
#7 Filtering:

df[df['Age']>16] #print()

      Name  Age         City  Mark
1      Bob   17  Bhubaneswar    20
2  Charlie   19    Berhampur    30
3     John   18     Rourkela    40

In [10]:
#8 Subset:

df.loc[1:3, ['Name', 'Age']] #print()

      Name  Age
1      Bob   17
2  Charlie   19
3     John   18

In [20]:
# Fill missing value using average of column then sort the dataframe using that column

Bdata = {'Name':['Alice', 'Bob', 'Charlie'], 'Age':[15, None, 13], 'City':['Cuttack', 'Bhubaneswar', 'Berhampur'], 'Mark':[10, None, 30]}
bf = pd.DataFrame(Bdata)
print(bf)

bf['Age'] = bf['Age'].fillna(bf['Age'].mean())
bf['Mark'] = bf['Mark'].fillna(bf['Mark'].mean())
#bf = bf.fillna(x) will fill all the None values with x irrespective of the columns
print("\n", bf)

bf = bf.sort_values(by='Age')
print("\n", bf)

      Name   Age         City  Mark
0    Alice  15.0      Cuttack  10.0
1      Bob   NaN  Bhubaneswar   NaN
2  Charlie  13.0    Berhampur  30.0

       Name   Age         City  Mark
0    Alice  15.0      Cuttack  10.0
1      Bob  14.0  Bhubaneswar  20.0
2  Charlie  13.0    Berhampur  30.0

       Name   Age         City  Mark
2  Charlie  13.0    Berhampur  30.0
1      Bob  14.0  Bhubaneswar  20.0
0    Alice  15.0      Cuttack  10.0